var schoolData = [
  {
    "value": "110000",
    "text": "文学与新闻学院",
    "children": [
      {
        "value": "110101",
        "text": "汉语言文学"
      },
      {
        "value": "110102",
        "text": "汉语国际教育"
      },
      {
        "value": "110103",
        "text": "广播电视学"
      },
      {
        "value": "110104",
        "text": "文化产业管理"
      },
      {
        "value": "110105",
        "text": "广播电视编导"
      },
      {
        "value": "110106",
        "text": "播音与主持艺术"
      }
    ]
  },
  {
    "value": "120000",
    "text": "政法学院",
    "children": [
      {
        "value": "120101",
        "text": "思想政治教育"
      },
      {
        "value": "120102",
        "text": "历史学"
      },
      {
        "value": "120103",
        "text": "行政管理"
      },
      {
        "value": "120104",
        "text": "法律事务"
      }
    ]
  },
  {
    "value": "130000",
    "text": "外国语学院",
    "children": [
      {
        "value": "130100",
        "text": "英语"
      },
      {
        "value": "130200",
        "text": "翻译"
      },
      {
        "value": "130300",
        "text": "商务英语"
      },
      {
        "value": "130400",
        "text": "英语教育"
      }
    ]
  },
  {
    "value": "140000",
    "text": "数学学院",
    "children": [
      {
        "value": "140100",
        "text": "数学与应用数学"
      }
    ]
  },
  {
    "value": "150000",
    "text": "智能制造学院",
    "children": [
      {
        "value": "150100",
        "text": "数字媒体技术"
      },
      {
        "value": "150200",
        "text": "物联网工程"
      },
      {
        "value": "150300",
        "text": "计算机科学与技术"
      },
      {
        "value": "150400",
        "text": "机械电子工程"
      },
      {
        "value": "150500",
        "text": "物理学"
      },
      {
        "value": "150600",
        "text": "电子科学技术"
      },
      {
        "value": "150700",
        "text": "机械工程"
      }
    ]
  },
  {
    "value": "210000",
    "text": "化学化工学院",
    "children": [
      {
        "value": "210100",
        "text": "化学"
      },
      {
        "value": "210200",
        "text": "化学工程与工艺"
      },
      {
        "value": "210300",
        "text": "应用化学"
      },
      {
        "value": "210400",
        "text": "制药工程"
      }
    ]
  },
  {
    "value": "220000",
    "text": "音乐与演艺学院",
    "children": [
      {
        "value": "220100",
        "text": "音乐学"
      },
      {
        "value": "220200",
        "text": "音乐教育"
      },
      {
        "value": "220300",
        "text": "音乐舞蹈教育"
      }
    ]
  },
  {
    "value": "230000",
    "text": "康养产业学院",
    "children": [
      {
        "value": "230100",
        "text": "物业管理"
      },
      {
        "value": "230200",
        "text": "老年服务与管理"
      }
    ]
  },
  {
    "value": "310000",
    "text": "体育学院",
    "children": [
      {
        "value": "310101",
        "text": "体育教育"
      },
      {
        "value": "310103",
        "text": "社会体育指导与管理"
      }
    ]
  },
  {
    "value": "320000",
    "text": "财经管理学院",
    "children": [
      {
        "value": "320100",
        "text": "人力资源管理"
      },
      {
        "value": "320200",
        "text": "财务管理"
      },
      {
        "value": "320300",
        "text": "物流管理"
      },
      {
        "value": "320400",
        "text": "审计学"
      },
      {
        "value": "320500",
        "text": "电子商务"
      },
      {
        "value": "320600",
        "text": "市场营销"
      },
      {
        "value": "320700",
        "text": "会计"
      }
    ]
  },
  {
    "value": "320000",
    "text": "生态旅游学院",
    "children": [
      {
        "value": "320100",
        "text": "酒店管理"
      },
      {
        "value": "320200",
        "text": "旅游管理"
      }
    ]
  },
  {
    "value": "320000",
    "text": "建筑工程学院",
    "children": [
      {
        "value": "320100",
        "text": "工程造价"
      },
      {
        "value": "320200",
        "text": "土木工程"
      },
      {
        "value": "320200",
        "text": "城乡规划"
      }
    ]
  },
  {
    "value": "320000",
    "text": "美术学院",
    "children": [
      {
        "value": "320100",
        "text": "视觉传达设计"
      },
      {
        "value": "320200",
        "text": "产品设计"
      },
      {
        "value": "320200",
        "text": "环境设计"
      },
      {
        "value": "320200",
        "text": "服装与服饰设计"
      },
      {
        "value": "320200",
        "text": "美术学"
      }
    ]
  },
  {
    "value": "320000",
    "text": "教师教育学院",
    "children": [
      {
        "value": "320100",
        "text": "应用心理学"
      },
      {
        "value": "320200",
        "text": "学前教育"
      },
      {
        "value": "320200",
        "text": "特殊教育"
      },
      {
        "value": "320200",
        "text": "小学教育"
      }
    ]
  },
  {
    "value": "320000",
    "text": "继续教育学院"
  },
  {
    "value": "320000",
    "text": "马克思学院"
  },
  {
    "value": "320000",
    "text": "创新创业学院"
  }
]